import {Genre} from "../types/IMovie";

export const getYearsRange = () => {
    let from = 1980;
    let to = 2022;

    let resultArr: string[] = [];
    for (let i = from; i <= to; i++) {
        resultArr.push(String(i));
    }
    resultArr.push("");
    return resultArr.reverse();
}

export const genres: string[] = [
    "", "аниме", "биография", "боевик", "вестерн", "военный", "детектив", "детский", "для взрослых",
    "документальный", "драма", "игра", "история", "комедия", "концерт", "короткометражка", "криминал",
    "мелодрама", "музыка", "мультфильм", "мюзикл", "новости", "приключения", "реальное ТВ",
    "семейный", "спорт", "ток-шоу", "триллер", "ужасы", "фантастика", "фильм-нуар",
    "фэнтези", "церемония"]